alexvatti/embedded-documents/SoC-Validation/firmware/gpu_validation/gpu/gp/m400_gp_F208_plbu_set_rsw_vdb_address_00_check_0_f.c
/*----------------------------------------------------------------------------
*
* The confidential and proprietary information contained in this file may
* only be used by a person authorised under and to the extent permitted
* by a subsisting licensing agreement from ARM Limited.
*
*        (C) COPYRIGHT 2008-2009 ARM Limited.
*             ALL RIGHTS RESERVED
*             
* This entire notice must be reproduced on all copies of this file
* and copies of this file may only be made by a person if such person is
* permitted to do so under the terms of a subsisting license agreement
* from ARM Limited.
*
* Modified  : $Date: 2013/05/14 11:57:51 $
* Revision  : $Revision: 1.1 $
* Release   : $State: Exp $
*-----------------------------------------------------------------------------*/
#include "m400_gp_F208_plbu_set_rsw_vdb_address_00_check_0_f.h"
struct t_CheckData_m400_gp_F208_plbu_set_rsw_vdb_address_00_check_0_f __attribute__ ((section(".mali_data_check"))) CheckData_m400_gp_F208_plbu_set_rsw_vdb_address_00_check_0_f = {
/* unsigned int data_00002d80[] = */
{
 0x0080003f,0x01500104,0x00860042,0x01500110 /* 00002d80 */
,0x00920048,0x01500128,0x009e004e,0x01500140 /* 00002d90 */
,0x00a40051,0x0150014c,0x00aa0054,0x01500158 /* 00002da0 */
,0x00c20060,0x01500188,0x00c80063,0x01500194 /* 00002db0 */
,0x00ce0066,0x015001a0,0x00d40069,0x015001ac /* 00002dc0 */
,0x00e0006f,0x015001c4,0x00ec0075,0x015001dc /* 00002dd0 */
,0x00f8007b,0x015001f4,0x010a0084,0x01500218 /* 00002de0 */
,0x0116008a,0x01500230,0x00000680,0xb0000000 /* 00002df0 */
,0x00920048,0x01500128,0x0098004b,0x01500134 /* 00002e00 */
,0x00b00057,0x01500164,0x00b6005a,0x01500170 /* 00002e10 */
,0x00bc005d,0x0150017c,0x00ce0066,0x015001a0 /* 00002e20 */
,0x00e60072,0x015001d0,0x00f20078,0x015001e8 /* 00002e30 */
,0x00fe007e,0x01500200,0x01100087,0x01500224 /* 00002e40 */
,0x01280093,0x01500254,0xe0000003,0xb0000000 /* 00002e50 */
},
};

